app/views/pages/top.html.haml

  .container-inner
    - @students.each do |student|
      .col-md-3.student-content
---
SELECT `students`.* FROM `students`