app/controllers/pages_controller.rb

  def top
    @students = Student.all
    @lab_status =
      if LabStatus.where(light_entry: '1').last.present?
---
SELECT `students`.* FROM `students`
SELECT  `lab_statuses`.* FROM `lab_statuses` WHERE `lab_statuses`.`light_entry` = 1 ORDER BY `lab_statuses`.`id` DESC LIMIT 1