app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT `students`.* FROM `students`

  def show
    @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1

  def create
    @student = Student.new(params_student)
    if @student.save
---
INSERT INTO `students` (`name`, `year`, `image`, `memo`, `created_at`, `updated_at`) VALUES ('諸橋亮太', 3, 'mardaathuko.jpg', '', '2018-04-11 16:16:47', '2018-04-11 16:16:47')

  def edit
    @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1

  def update
    @student = Student.find(params[:id])

    if params[:student][:exit_time].present?
      # thick of time branch case
      @student.total_time += @student.exit_time.strftime("%H").to_i - @student.entry_time.strftime("%H").to_i
      @student.update(total_time: @student.total_time)
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `entry_time` = '2019-04-24 00:42:15', `are_you_now` = 0, `updated_at` = '2019-04-24 00:42:16' WHERE `students`.`id` = 1